---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUnique
source: html/c250f1c5-e8e8-2231-ddce-130ce90f13ca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUnique Property

Element must be unique.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyMustBeUnique { get; }
```